export default [{
  date: '2022-08',
  jobsDone: [
    '프로필 세팅 기능 개선',
    '최종 업데이트 시각을 트레이더별로 기록',
    '헤더의 개인화 설정 기능에서 김프 페이지에만 적용되는 기능을 분리하여 김프 페이지로 이동',
    '온체인 > 고래 입출금 추가',
  ],
}, {
  date: '2022-07',
  jobsDone: [
    '온체인 > 리치리스트 페이지 추가',
    '앱 > 로또 시뮬레이터 페이지 추가',
    '채팅에 사진 첨부 기능 추가',
    '채팅에서 다른 사람에게 답장하는 기능 추가',
    '앱 > 검색 엔진 최적화 페이지 추가',
    'WYSIWYG 에디터를 Quill > ToastUIEditor로 교환',
  ],
}, {
  date: '2022-05',
  jobsDone: [
    '실시간 포지션 수정 요청 & 직접 수정 기능 추가 (운영자가 간헐적으로 열어두는 시간대는 직접 수정 가능)',
    '채팅창을 닫은 상태에서 메시지가 왔을 때 벨 알림 추가 & 아이콘 흔들림 애니메이션',
    '채팅창을 드래그하여 위치를 조절할 수 있도록 변경 & 불투명 배경 설정 가능하도록 변경',
    '도네이션 기능 추가 (QRCode)',
    '채팅 프로필 이미지 설정 기능 추가 & 채팅 설정을 따로 다이얼로그로 뺌',
    '채팅 참여자들을 볼 수 있는 기능 추가',
    '롱 & 숏 페이지 추가',
    '시가총액 > 나스닥 추가 및 시가총액 메뉴 이동',
  ],
}, {
  date: '2022-04-29',
  jobsDone: [
    '연봉 계산기에 해당 세전 연봉이 상위 몇 %인지 보여주는 기능 추가',
  ],
}, {
  date: '2022-04-15',
  jobsDone: [
    '실시간 포지션 업데이트 (바이빗 모바일 인터페이스 형태)',
  ],
}, {
  date: '2022-04-11',
  jobsDone: [
    '녹음기 앱 추가 (대체 왜?)',
  ],
}, {
  date: '2022-03-20',
  jobsDone: [
    '연봉 계산기 추가 (세전, 세후, 암호화폐 현 싯가로 환산)',
  ],
}, {
  date: '2022-03-11',
  jobsDone: [
    '시가총액 API를 coingecko => coinmarketcap으로 변경',
  ],
}, {
  date: '2022-03-10',
  jobsDone: [
    '리더보드 하단에 실시간 포지션 항목이 추가.',
  ],
}, {
  date: '2022-03-08',
  jobsDone: [
    '너무 어두웠던 다크모드 배경색을 좀 더 밝게 변경',
  ],
}, {
  date: '2022-02-16',
  jobsDone: [
    `'비트코인 보유회사' => '비트코인 보유단체'로 변경`,
  ],
}, {
  date: '2022-01-11',
  jobsDone: [
    'TradingView Ticker Widget 추가',
  ],
}, {
  date: '2022-01-09',
  jobsDone: [
    '뉴스 섹션 추가',
  ],
}, {
  date: '2022-01-07',
  jobsDone: [
    'SSR 적용 (SEO)',
  ],
}, {
  date:' 2021-12-16',
  jobsDone: [
    '백엔드에서 불러오던 일부 API 프론트엔드로 이동 (거래소가 점검하는 경우의 예외 처리)',
  ],
}, {
  date: '2021-12-09',
  jobsDone: [
    '빗썸 등 특정 외부 API들이 응답하지 않는 경우에 웹사이트가 정상 작동하지 못하던 문제 수정',
  ],
}, {
  date: '2021-11-24',
  jobsDone: [
    '비트코인 보유 상장사들 목록 추가',
  ],
}, {
  date: '2021-11-05',
  jobsDone: [
    `유명 지표가 되는 사이트들을 소개하는 '지표 > 일반' 섹션 추가`,
    '티커에 차트보기 기능 추가',
  ],
}, {
  date: '2021-11-02',
  jobsDone: [
    '인플루언서 정보 추가',
  ],
}, {
  date: '2021-10-20',
  jobsDone: [
    '채팅창이 접혀있는 동안 날아온 읽지 않은 메시지 개수 기능 추가',
  ],
}, {
  date: '2021-10-19',
  jobsDone: [
    '채팅창을 위로 끝까지 스크롤시 지난 대화내역을 보여주는 기능 추가',
  ],
}, {
  date: '2021-10-17',
  jobsDone: [
    '기준 거래소로 빗썸 추가',
  ],
}, {
  date: '2021-10-06',
  jobsDone: [
    `글쓰기를 할 때 이미지를 업로드하면 커서 위치가 깨지는 버그 수정`,
    '채팅에 날짜 구분선 추가',
  ],
}, {
  date: '2021-10-05',
  jobsDone: [
    `'알림' 기능 추가`,
    `커뮤니티 상단에 '공지사항' 추가`,
    '게시글 작성시 그림 파일 첨부 기능 추가',
  ],
}, {
  date: '2021-10-01',
  jobsDone: [
    `'커뮤니티' 오픈 (사진업로드 기능 추가 예정)`,
    '포트폴리오에서 고정자산을 변경할 때 모달을 열지 않도록 변경',
  ],
}, {
  date: '2021-09-26',
  jobsDone: [
    `'포트폴리오' 기능 추가`,
  ],
}, {
  date: '2021-09-23',
  jobsDone: [
    '앱 버전 (백엔드 & 프론트엔드) 체킹 기능 추가 및 토스트 위치 하단으로 이동',
  ],
}, {
  date: '2021-09-13',
  jobsDone: [
    '커뮤니티 기본 구현 (글쓰기, 수정, 글 열람, 목록보기, 댓글, 답글, 삭제)',
  ],
}, {
  date: '2021-08-27',
  jobsDone: [
    '업비트와의 연결이 끊긴 경우 자동으로 재연결 시도',
  ],
}, {
  date: '2021-08-20',
  jobsDone: [
    'Bybit 호가창 기능 추가',
  ],
}, {
  date: '2021-08-18',
  jobsDone: [
    '로더에 파비콘 사용',
    '비트멕스 리더보드 추가 (워뇨띠 포지션)',
    '색 감각 테스트: 매 스테이지 클리어시마다 15초를 새로 부여하도록 변경',
  ],
}, {
  date: '2021-08-11',
  jobsDone: [
    '서버 이전',
    '다크 모드 가시성 개선',
    '다크 모드 = bybit, 라이트 모드 = upbit로 확정',
  ],
}, {
  date: '2021-08-02',
  jobsDone: [
    '불필요한 계산 & 렌더링 제거하여 성능 크게 개선',
  ],
}, {
  date: '2021-07-31',
  jobsDone: [
    '색 감각 테스트 게임 추가',
  ],
}, {
  date: '2021-07-30',
  jobsDone: [
    '코인 뒤집기 게임 추가',
  ],
}, {
  date: '2021-07-28',
  jobsDone: [
    '욕설 필터링',
    '위로 스크롤 된 상태에서 채팅 왔을 때 자동 스크롤되지 않도록 변경',
    '위로 스크롤 된 상태에서 온 채팅을 카카오톡처럼 하단에 오버레이로 표시',
    '가격 정보들에 monospace 글꼴 사용',
  ],
}, {
  date: '2021-07-27',
  jobsDone: [
    '오픈그래프 세팅',
  ],
}, {
  date: '2021-07-25',
  jobsDone: [
    'Modal: 업비트 호가창 구현',
  ],
}, {
  date: '2021-07-22',
  jobsDone: [
    '시총 정보에 Coingecko API 사용하도록 변경',
  ],
}, {
  date: '2021-07-20',
  jobsDone: [
    '배포 및 SSL 세팅',
  ],
}, {
  date: '2021-07-12',
  jobsDone: [
    '레포 생성',
  ],
}]